*** whisker plots

The first order of business is to calcuate whisker plots for every parameter
used for ETo calculation. We are getting these for both the station data, and
the raster data.  In addition to the whisker plots, we take the average as well.
We take this for the complete history of our study.

#+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
set search_path=compare,catalogs,public;

create materialized view ymd15_station_raster_whisker as
with r as (
select station_id, ymd15, count(*) as r_count,
avg(eto) as eto_r,whisker(eto::numeric) as eto_rw,
avg(tn) as tn_r,whisker(tn::numeric) as tn_rw,
avg(tx) as tx_r,whisker(tx::numeric) as tx_rw,
avg(tdew) as tdew_r,whisker(tdew::numeric) as tdew_rw,
avg(rs) as rs_r,whisker(rs::numeric) as rs_rw,
avg(rso) as rso_r,whisker(rso::numeric) as rso_rw,
avg(rnl) as rnl_r,whisker(rnl::numeric) as rnl_rw,
avg(u2) as u2_r,whisker(u2::numeric) as u2_rw,
avg(k) as k_r,whisker(k::numeric) as k_rw
from raster join avg_dates using (ymd)
group by station_id,ymd15),
s as (
select station_id, ymd15, count(*) as s_count,
avg(asce_eto) as eto_s,whisker(asce_eto::numeric) as eto_sw,
avg(air_tmp_min) as tn_s,whisker(air_tmp_min::numeric) as tn_sw,
avg(air_tmp_max) as tx_s,whisker(air_tmp_max::numeric) as tx_sw,
avg(dew_pnt) as tdew_s,whisker(dew_pnt::numeric) as tdew_sw,
avg(sol_rad_avg*24*0.0036) as rs_s,whisker((sol_rad_avg*24*0.0036)::numeric) as rs_sw,
--avg(rso) as rso_s,hisker(rso::numeric) as rso_sw,
--avg(rnl) as rnl_s,whisker(rnl::numeric) as rnl_sw,
avg(wind_spd_avg) as u2_s,whisker(wind_spd_avg::numeric) as u2_sw
--avg(k) as k_r,(whisker(k::numeric) as kr_w
from station join avg_dates using (ymd)
group by station_id,ymd15
),
l as (
select station_id,ymd15,
avg(eto) as eto_lt,whisker(eto::numeric) as eto_ltw
from lt_15day join
(select ymd15,extract(doy from ymd) as doy from avg_dates) as d
using(doy)
group by station_id,ymd15
),
j as (
select * from r full outer join s
using (station_id,ymd15)
full outer join l
using (station_id,ymd15)
)
select j.*,s.elevation/3.28084 as z from j join station_info s using (station_id);
 #+END_SRC

 #+RESULTS:
 SET
 SELECT 156000

*** Average Whisker Plot

In addition to this, we also take the overall average, and whisker plot over all
the years.  This is what we use to make our comparisions between the lt, the
station, and the raster measurements.

#+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
set search_path=compare,catalogs,public;

create materialized view station_raster_whisker as
with r as (
select station_id,m,d, count(*) as r_count,
avg(eto) as eto_r,whisker(eto::numeric) as eto_rw,
avg(tn) as tn_r,whisker(tn::numeric) as tn_rw,
avg(tx) as tx_r,whisker(tx::numeric) as tx_rw,
avg(tdew) as tdew_r,whisker(tdew::numeric) as tdew_rw,
avg(rs) as rs_r,whisker(rs::numeric) as rs_rw,
avg(rso) as rso_r,whisker(rso::numeric) as rso_rw,
avg(rnl) as rnl_r,whisker(rnl::numeric) as rnl_rw,
avg(u2) as u2_r,whisker(u2::numeric) as u2_rw,
avg(k) as k_r,whisker(k::numeric) as k_rw
from raster join avg_dates using (ymd)
group by station_id,m,d),
s as (
select station_id, m,d, count(*) as s_count,
avg(asce_eto) as eto_s,whisker(asce_eto::numeric) as eto_sw,
avg(air_tmp_min) as tn_s,whisker(air_tmp_min::numeric) as tn_sw,
avg(air_tmp_max) as tx_s,whisker(air_tmp_max::numeric) as tx_sw,
avg(dew_pnt) as tdew_s,whisker(dew_pnt::numeric) as tdew_sw,
avg(sol_rad_avg*24*0.0036) as rs_s,whisker((sol_rad_avg*24*0.0036)::numeric) as rs_sw,
--avg(rso) as rso_s,hisker(rso::numeric) as rso_sw,
--avg(rnl) as rnl_s,whisker(rnl::numeric) as rnl_sw,
avg(wind_spd_avg) as u2_s,whisker(wind_spd_avg::numeric) as u2_sw
--avg(k) as k_r,(whisker(k::numeric) as kr_w
from station join avg_dates using (ymd)
group by station_id,m,d
),
l as (
select station_id,m,d,
avg(eto) as eto_lt,whisker(eto::numeric) as eto_ltw
from lt_15day join
(select m,d,extract(doy from ymd) as doy from avg_dates) as d
using(doy)
group by station_id,m,d
),
j as (
select * from r full outer join s
using (station_id,m,d)
full outer join l
using (station_id,m,d)
)
select j.*,s.elevation/3.28084 as z from j join station_info s using (station_id);
 #+END_SRC

And we can take a statewide look at this as well.

#+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
set search_path=compare,catalogs,public;

create materialized view station_raster_whisker_statewide as
with r as (
select m,d, count(*) as r_count,
avg(eto) as eto_r,whisker(eto::numeric) as eto_rw,
avg(tn) as tn_r,whisker(tn::numeric) as tn_rw,
avg(tx) as tx_r,whisker(tx::numeric) as tx_rw,
avg(tdew) as tdew_r,whisker(tdew::numeric) as tdew_rw,
avg(rs) as rs_r,whisker(rs::numeric) as rs_rw,
avg(rso) as rso_r,whisker(rso::numeric) as rso_rw,
avg(rnl) as rnl_r,whisker(rnl::numeric) as rnl_rw,
avg(u2) as u2_r,whisker(u2::numeric) as u2_rw,
avg(k) as k_r,whisker(k::numeric) as k_rw
from raster join avg_dates using (ymd)
group by m,d),
s as (
select m,d, count(*) as s_count,
avg(s.elevation/3.28084) as z_s,whisker((s.elevation/3.28084)::numeric) as z_sw,
avg(asce_eto) as eto_s,whisker(asce_eto::numeric) as eto_sw,
avg(air_tmp_min) as tn_s,whisker(air_tmp_min::numeric) as tn_sw,
avg(air_tmp_max) as tx_s,whisker(air_tmp_max::numeric) as tx_sw,
avg(dew_pnt) as tdew_s,whisker(dew_pnt::numeric) as tdew_sw,
avg(sol_rad_avg*24*0.0036) as rs_s,whisker((sol_rad_avg*24*0.0036)::numeric) as rs_sw,
--avg(rso) as rso_s,hisker(rso::numeric) as rso_sw,
--avg(rnl) as rnl_s,whisker(rnl::numeric) as rnl_sw,
avg(wind_spd_avg) as u2_s,whisker(wind_spd_avg::numeric) as u2_sw
--avg(k) as k_r,(whisker(k::numeric) as kr_w
from station join avg_dates using (ymd)
join station_info s using (station_id)
group by m,d
),
l as (
select m,d,
avg(eto) as eto_lt,whisker(eto::numeric) as eto_ltw
from lt_15day join
(select m,d,extract(doy from ymd) as doy from avg_dates) as d
using(doy)
group by m,d
),
j as (
select * from r full outer join s
using (m,d)
full outer join l
using (m,d)
)
select * from j;
 #+END_SRC

 #+RESULTS:
 SET
 SELECT 52
 SET
 SET
 SET

*** station_raster_eto_mixin_best_zone

Using the above function, we can then calculate the best zone for all these
combinations.

#+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
set search_path=compare,catalogs,public;

create materialized view station_raster_eto_mixin_best_zone as
select station_id,
get_best_zone(lt) as lt,
get_best_zone(r) as r,
get_best_zone(s) as s,
get_best_zone(r_x0) as r_x0,
get_best_zone(r_xs) as r_xs,
get_best_zone(r_xu) as r_xu,
get_best_zone(r_xsu) as r_xsu,
get_best_zone(s_x0) as s_x0,
get_best_zone(s_xs) as s_xs,
get_best_zone(s_xu) as s_xu,
get_best_zone(s_xsu) as s_xsu
from station_raster_eto_mixin;
 #+END_SRC

 #+RESULTS:
 SET

** Davis / Statewide Examples

Here are the methods to pull out station info, or the statewide data for
parameter examples.

This is for Davis.

#+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
create temp view davis as
select m,d,
(eto_r)::decimal(6,2),
(tn_r)::decimal(6,2),
(tx_r)::decimal(6,2),
(tdew_r)::decimal(6,2),
(u2_r)::decimal(6,2),
(rs_r)::decimal(6,2),
(rnl_r)::decimal(6,2),
(eto_rw).qn::decimal(6,2) as eto_qn,
(tn_rw).qn::decimal(6,2) as tn_qn,
(tx_rw).qn::decimal(6,2) as tx_qn,
(tdew_rw).qn::decimal(6,2) as tdew_qn,
(u2_rw).qn::decimal(6,2) as u2_qn,
(rs_rw).qn::decimal(6,2) as rs_qn,
(rnl_rw).qn::decimal(6,2) as rnl_qn,
(eto_rw).qx::decimal(6,2) as eto_qx,
(tn_rw).qx::decimal(6,2) as tn_qx,
(tx_rw).qx::decimal(6,2) as tx_qx,
(tdew_rw).qx::decimal(6,2) as tdew_qx,
(u2_rw).qx::decimal(6,2) as u2_qx,
(rs_rw).qx::decimal(6,2) as rs_qx,
(rnl_rw).qx::decimal(6,2) as rnl_qx
from compare.station_raster_whisker
where station_id=6
order by CASE WHEN (m<10) THEN m+12 ELSE m END,d ;

\copy (select * from davis) to davis.csv with csv header

#+END_SRC

#+RESULTS:
CREATE VIEW
COPY 52

And for the Statewide example

#+BEGIN_SRC sql :results raw :database eto_zones :engine postgresql
create temp view sw as
select m,d,
(eto_r)::decimal(6,2),
(tn_r)::decimal(6,2),
(tx_r)::decimal(6,2),
(tdew_r)::decimal(6,2),
(u2_r)::decimal(6,2),
(rs_r)::decimal(6,2),
(rnl_r)::decimal(6,2),
(eto_rw).qn::decimal(6,2) as eto_qn,
(tn_rw).qn::decimal(6,2) as tn_qn,
(tx_rw).qn::decimal(6,2) as tx_qn,
(tdew_rw).qn::decimal(6,2) as tdew_qn,
(u2_rw).qn::decimal(6,2) as u2_qn,
(rs_rw).qn::decimal(6,2) as rs_qn,
(rnl_rw).qn::decimal(6,2) as rnl_qn,
(eto_rw).qx::decimal(6,2) as eto_qx,
(tn_rw).qx::decimal(6,2) as tn_qx,
(tx_rw).qx::decimal(6,2) as tx_qx,
(tdew_rw).qx::decimal(6,2) as tdew_qx,
(u2_rw).qx::decimal(6,2) as u2_qx,
(rs_rw).qx::decimal(6,2) as rs_qx,
(rnl_rw).qx::decimal(6,2) as rnl_qx
from compare.station_raster_whisker_statewide
order by CASE WHEN (m<10) THEN m+12 ELSE m END,d ;

\copy (select * from sw) to statewide.csv with csv header

#+END_SRC

#+RESULTS:
CREATE VIEW
COPY 52
